{
    "project": {
        "projectId": 4223,
        "title": "Characterization and Modeling of Neutron and Gamma-Ray Radiation Damage in Silicon Carbide Semi-Conductor Materials and Silica Optical Fibers at Cryogenic Temperature",
        "primaryTaxonomyNodes": [
            {
                "taxonomyNodeId": 10874,
                "taxonomyRootId": 8816,
                "parentNodeId": 10870,
                "level": 3,
                "code": "TX12.3.4",
                "title": "Reliability, Life Assessment, and Health Monitoring",
                "definition": "This area covers technologies for timely anomaly detection, prognosis, and life assessment prediction for vehicles or mechanical systems.",
                "exampleTechnologies": "Integrated health monitoring systems including embedded sensors, damage and remaining life prediction techniques",
                "hasChildren": false,
                "hasInteriorContent": true
            }
        ],
        "startTrl": 2,
        "currentTrl": 3,
        "endTrl": 3,
        "benefits": "This project investigates radiation damage in silicon carbide and silica optical fiber. These two materials are of particular importance because semi-conductor material like silicon carbide is prevalent in many current and future electronic designs and silica optical fibers can be used for fast and efficient electronics and communication. Because NASA operates advanced electronics and communication systems in the extremely cold conditions of space, these materials are of particular importance. Space hardware is subjected to heightened levels of space background radiation. But more importantly, some deep space probes like Viking I use nuclear fuel, and future space propulsion systems involve the use of a nuclear reactor. By subjecting the space electronics and communications systems to these high levels of radioactivity at low temperatures, it is evident that is hypothesized that a heightened level of radiation damage will occur. If enough damage occurs, it could component failure and possible mission failure. This research project addresses a number of NASA's Grand Challenges would be applicable to the goals of multiple research divisions within NASA. For example, the NASA Glenn Research Center's Electron and Opto-Electronic Devices Branch would be able to use the specific research when designing next generation spacecraft electronics.",
        "description": "When radiation is incident upon a material, it can knock atoms within the lattice out of their proper positions. However, this damage can often be overcome because when lattice atoms have energy, the dislocated (interstitial) atoms can go back to their original positions or fill other vacancies left by other dislocated atoms. This process of annealing allows most damages to be repaired. Damages that are not annealed can affect the structural stability of a material, the electrical properties of a material and the optical properties of a material. Furthermore, annealing is less effective at lower temperatures than at higher temperatures because the temperature of a solid is a measurement of the kinetic energy in the lattice atoms. This means that radiation at lower temperatures could cause greater damage in a specific material, since less of the damage would anneal.   This proposal details the methods for researching this phenomenon in silicon carbide and silica optical fiber. These two materials are of particular importance because semi-conductor material like silicon carbide is prevalent in many current and future electronic designs and silica optical fibers can be used for fast and efficient electronics and communication. Because NASA operates advanced electronics and communication systems in the extremely cold conditions of space, these materials are of particular importance. Space hardware is subjected to heightened levels of space background radiation. But more importantly, some deep space probes like Viking I use nuclear fuel, and future space propulsion systems involve the use of a nuclear reactor. By subjecting the space electronics and communications systems to these high levels of radioactivity at low temperatures, it is evident that is hypothesized that a heightened level of radiation damage will occur. If enough damage occurs, it could component failure and possible mission failure. This research project addresses a number of NASA's Grand Challenges would be applicable to the goals of multiple research divisions within NASA. For example, the NASA Glenn Research Center's Electron and Opto-Electronic Devices Branch would be able to use the specific research outlined in this proposal when designing next generation spacecraft electronics.  I plan to investigate the radiation damage in semi-conductor material, silicon carbide and in silica fiber optics cables at very low temperatures. This research would be the basic work behind a Masters Thesis in nuclear engineering, which would provide me with nuclear engineering research experience with implications to many related fields. The research proposal will outline work that is aligned with my educational goals as well as NASA's research goals. In this research project, (1) SiC and silica optical fiber will be irradiated at the Ohio State University Research Reactor at varying fluences of neutron and gamma-ray irradiation and the irradiation damage will be characterized at low temperatures and while the temperature rises to room temperature, 2) the neutron irradiation will be modeled in order to determine a theoretical model for neutron damage, (3) the results of the experiment will be compared with the model.",
        "startYear": 2011,
        "startMonth": 9,
        "endYear": 2015,
        "endMonth": 8,
        "statusDescription": "Completed",
        "principalInvestigators": [
            {
                "contactId": 462089,
                "firstName": "Thomas",
                "lastName": "Blue",
                "fullName": "Thomas Blue",
                "fullNameInverted": "Blue, Thomas",
                "primaryEmail": "blue.1@osu.edu",
                "publicEmail": false,
                "nacontact": false
            }
        ],
        "programDirectors": [
            {
                "contactId": 84634,
                "firstName": "Claudia",
                "lastName": "Meyer",
                "fullName": "Claudia M Meyer",
                "fullNameInverted": "Meyer, Claudia M",
                "middleInitial": "M",
                "primaryEmail": "claudia.m.meyer@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programExecutives": [
            {
                "contactId": 84634,
                "firstName": "Claudia",
                "lastName": "Meyer",
                "fullName": "Claudia M Meyer",
                "fullNameInverted": "Meyer, Claudia M",
                "middleInitial": "M",
                "primaryEmail": "claudia.m.meyer@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programManagers": [
            {
                "contactId": 183514,
                "firstName": "Hung",
                "lastName": "Nguyen",
                "fullName": "Hung D Nguyen",
                "fullNameInverted": "Nguyen, Hung D",
                "middleInitial": "D",
                "primaryEmail": "hung.d.nguyen@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "coInvestigators": [
            {
                "contactId": 41116,
                "firstName": "Benjamin",
                "lastName": "Reinke",
                "fullName": "Benjamin T Reinke",
                "fullNameInverted": "Reinke, Benjamin T",
                "middleInitial": "T",
                "primaryEmail": "reinke.12@osu.edu",
                "publicEmail": false,
                "nacontact": false
            }
        ],
        "website": "https://www.nasa.gov/directorates/spacetech/home/index.html",
        "libraryItems": [
            {
                "caption": "Project Image   Characterization and Modeling of Neutron and Gamma-Ray Radiation Damage in Silicon Carbide Semi-Conductor Materials and Silica Optical Fibers at Cryogenic Temperature",
                "file": {
                    "fileExtension": "jpg",
                    "fileId": 1726,
                    "fileName": "4223-1363116622321",
                    "fileSize": 194342,
                    "objectId": 934,
                    "objectType": {
                        "lkuCodeId": 889,
                        "code": "LIBRARY_ITEMS",
                        "description": "Library Items",
                        "lkuCodeTypeId": 182,
                        "lkuCodeType": {
                            "codeType": "OBJECT_TYPE",
                            "description": "Object Type"
                        }
                    },
                    "objectTypeId": 889,
                    "fileSizeString": "194.3 KB"
                },
                "files": [
                    {
                        "fileExtension": "jpg",
                        "fileId": 1726,
                        "fileName": "4223-1363116622321",
                        "fileSize": 194342,
                        "objectId": 934,
                        "objectType": {
                            "lkuCodeId": 889,
                            "code": "LIBRARY_ITEMS",
                            "description": "Library Items",
                            "lkuCodeTypeId": 182,
                            "lkuCodeType": {
                                "codeType": "OBJECT_TYPE",
                                "description": "Object Type"
                            }
                        },
                        "objectTypeId": 889,
                        "fileSizeString": "194.3 KB"
                    }
                ],
                "id": 934,
                "title": "4223-1363116622321.jpg",
                "description": "Project Image   Characterization and Modeling of Neutron and Gamma-Ray Radiation Damage in Silicon Carbide Semi-Conductor Materials and Silica Optical Fibers at Cryogenic Temperature",
                "libraryItemTypeId": 1095,
                "projectId": 4223,
                "primary": true,
                "publishedDateString": "",
                "contentType": {
                    "lkuCodeId": 1095,
                    "code": "IMAGE",
                    "description": "Image",
                    "lkuCodeTypeId": 341,
                    "lkuCodeType": {
                        "codeType": "LIBRARY_ITEM_TYPE",
                        "description": "Library Item Type"
                    }
                }
            }
        ],
        "transitions": [],
        "primaryImage": {
            "file": {
                "fileExtension": "jpg",
                "fileId": 1726,
                "fileSizeString": "0 Byte"
            },
            "id": 934,
            "description": "Project Image   Characterization and Modeling of Neutron and Gamma-Ray Radiation Damage in Silicon Carbide Semi-Conductor Materials and Silica Optical Fibers at Cryogenic Temperature",
            "projectId": 4223,
            "publishedDateString": ""
        },
        "responsibleMd": {
            "acronym": "STMD",
            "canUserEdit": false,
            "city": "",
            "external": false,
            "linkCount": 0,
            "organizationId": 4875,
            "organizationName": "Space Technology Mission Directorate",
            "organizationType": "NASA_Mission_Directorate",
            "naorganization": false,
            "organizationTypePretty": "NASA Mission Directorate"
        },
        "program": {
            "acronym": "STRG",
            "active": true,
            "description": "<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ",
            "programId": 69,
            "responsibleMd": {
                "acronym": "STMD",
                "canUserEdit": false,
                "city": "",
                "external": false,
                "linkCount": 0,
                "organizationId": 4875,
                "organizationName": "Space Technology Mission Directorate",
                "organizationType": "NASA_Mission_Directorate",
                "naorganization": false,
                "organizationTypePretty": "NASA Mission Directorate"
            },
            "responsibleMdId": 4875,
            "stockImageFileId": 36658,
            "title": "Space Technology Research Grants"
        },
        "statesWithWork": [
            {
                "abbreviation": "OH",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "name": "Ohio",
                "stateTerritoryId": 23
            }
        ],
        "lastUpdated": "2018-10-10",
        "releaseStatusString": "Released",
        "endDateString": "Aug 2015",
        "startDateString": "Sep 2011"
    }
}