{
    "project": {
        "projectId": 4319,
        "title": "Design and Demonstration of a Constrained Control System for Maneuverable CubeSats",
        "primaryTaxonomyNodes": [
            {
                "taxonomyNodeId": 10777,
                "taxonomyRootId": 8816,
                "parentNodeId": 10770,
                "level": 3,
                "code": "TX09.4.7",
                "title": "Guidance, Navigation and Control (GN&C) for EDL",
                "definition": "Guidance, navigation and control (GN&C) includes software and hardware required to execute de-orbit through landing phases of EDL with accuracy and robustness. Guidance algorithms are needed to find constrained, optimal paths for entry targeting, entry flight, and surface targeting. Control systems and algorithms are required to effectively steer vehicles to follow guided trajectories with minimum propellant, power, and mass requirements. Navigation systems and algorithms are needed to accurately determine vehicle state and attitude relative to environment and targets. Environment modeling includes technology that generates models or maps of terrain from images or other measurements.",
                "exampleTechnologies": "Advanced guidance algorithms for safe precision landing, advanced sensors for spacecraft velocimetry and altimetry, terrain digital elevation map or 3D model generation (offline), terrain digital elevation map or 3D model generation (onboard), synthetic terrain model generation/simulation",
                "hasChildren": false,
                "hasInteriorContent": true
            }
        ],
        "startTrl": 2,
        "currentTrl": 3,
        "endTrl": 3,
        "benefits": "In the short term, the development and demonstration of a reusable GN&C module will enable myriad scientific missions in the CubeSat platform. The autonomy provided by the advanced constrained control algorithms will enable complex picosatellite missions and decrease the cost of hardware by shifting requirements away from hardware and onto control software. In the long term, the spacecraft constrained control system has the ability to allow picosatellites to satisfy the complex formation constraints autonomously, thus enabling the operation of large constellations of cooperative CubeSats. Overall, these technologies have the potential to produce spacecraft missions that are more cost effective.",
        "description": "Picosatellites, such as CubeSats (less than 4 kg), have the potential to reduce the cost of conducting missions in space. Programs such as NASA Ames GeneSat and the National Science Foundation CubeSat-based Science Missions for Space Weather and Atmospheric Research underscore the notion that CubeSats are increasingly being considered viable platforms for scientific research.   However, many measurement and communication payloads require pointing, or orbital maneuvers. Thus, the missions that can be performed by picosatellites are limited by the lack of advanced, miniaturized six degree-of-freedom guidance, navigation, and control (GN&C) systems. Development of a reusable, autonomous GN&C module for CubeSats is necessary in order to enable increasingly complex missions to be conducted in the CubeSat form factor.  Picosatellites in general are highly constrained in their capabilities due to low mass, low volume, and therefore low power. The strength of the CubeSat is in numbers. Large constellations of picosatellites have the potential to revolutionize the way observations are obtained from orbit. In the future, these constellations of CubeSats will be similar to the global network of data buoys distributed throughout the oceans. Instead of taking measurements of the weather from the sea, CubeSats will be taking measurements of natural phenomena from space. These constellations will have complex pointing or formation requirements. As the number of spacecraft increases, the ability to control individual spacecraft in the constellation decreases. Therefore, these spacecraft must become capable of satisfying their own pointing and formation requirements autonomously.  As part of two separate CubeSat missions, one supported by the NASA LONESTAR program, the University of Texas at Austin is developing a miniaturized picosatellite GN&C module. This research intends to develop a fully functional autonomous constrained spacecraft control software to support the CubeSat GN&C module embedded computer. By leveraging computationally efficient numerical optimization schemes, such as semi-definite programming, complex spacecraft requirements can be governed at a very high level. The research will focus on both the algorithms and the optimal implementation onto a low power embedded computer. In order to test the complex autonomy enabling software, an advanced spacecraft simulation environment will be developed and improved to allow for dynamic testing of realistic, long-term autonomous CubeSat operations. The autonomous constrained control software developed in this proposal has the potential to be tested on orbit through the CubeSat missions mentioned above.   The research described in this proposal has the aim to create two major results in the NASA space technology areas of autonomous spacecraft control and autonomous rendezvous and docking. First, in the short term, the development and demonstration of a reusable GN&C module will enable myriad scientific missions in the CubeSat platform. The autonomy provided by the advanced constrained control algorithms will enable complex picosatellite missions and decrease the cost of hardware by shifting requirements away from hardware and onto control software. Second, in the long term, the spacecraft constrained control system has the ability to allow picosatellites to satisfy the complex formation constraints autonomously, thus enabling the operation of large constellations of cooperative CubeSats. Overall, these technologies have the potential to produce spacecraft missions that are more cost effective.",
        "startYear": 2011,
        "startMonth": 9,
        "endYear": 2015,
        "endMonth": 8,
        "statusDescription": "Completed",
        "principalInvestigators": [
            {
                "contactId": 167681,
                "firstName": "Glenn",
                "lastName": "Lightsey",
                "fullName": "Glenn Lightsey",
                "fullNameInverted": "Lightsey, Glenn",
                "publicEmail": false,
                "nacontact": false
            }
        ],
        "programDirectors": [
            {
                "contactId": 84634,
                "firstName": "Claudia",
                "lastName": "Meyer",
                "fullName": "Claudia M Meyer",
                "fullNameInverted": "Meyer, Claudia M",
                "middleInitial": "M",
                "primaryEmail": "claudia.m.meyer@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programExecutives": [
            {
                "contactId": 84634,
                "firstName": "Claudia",
                "lastName": "Meyer",
                "fullName": "Claudia M Meyer",
                "fullNameInverted": "Meyer, Claudia M",
                "middleInitial": "M",
                "primaryEmail": "claudia.m.meyer@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programManagers": [
            {
                "contactId": 183514,
                "firstName": "Hung",
                "lastName": "Nguyen",
                "fullName": "Hung D Nguyen",
                "fullNameInverted": "Nguyen, Hung D",
                "middleInitial": "D",
                "primaryEmail": "hung.d.nguyen@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "coInvestigators": [
            {
                "contactId": 178882,
                "firstName": "Henri",
                "lastName": "Kjellberg",
                "fullName": "Henri C Kjellberg",
                "fullNameInverted": "Kjellberg, Henri C",
                "middleInitial": "C",
                "primaryEmail": "henri.c.kjellberg@jpl.nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "website": "https://www.nasa.gov/directorates/spacetech/home/index.html",
        "libraryItems": [
            {
                "caption": "Project Image   Design and Demonstration of a Constrained Control System for Maneuverable CubeSats",
                "file": {
                    "fileExtension": "jpg",
                    "fileId": 1738,
                    "fileName": "4319-1363176383640",
                    "fileSize": 194342,
                    "objectId": 444,
                    "objectType": {
                        "lkuCodeId": 889,
                        "code": "LIBRARY_ITEMS",
                        "description": "Library Items",
                        "lkuCodeTypeId": 182,
                        "lkuCodeType": {
                            "codeType": "OBJECT_TYPE",
                            "description": "Object Type"
                        }
                    },
                    "objectTypeId": 889,
                    "fileSizeString": "194.3 KB"
                },
                "files": [
                    {
                        "fileExtension": "jpg",
                        "fileId": 1738,
                        "fileName": "4319-1363176383640",
                        "fileSize": 194342,
                        "objectId": 444,
                        "objectType": {
                            "lkuCodeId": 889,
                            "code": "LIBRARY_ITEMS",
                            "description": "Library Items",
                            "lkuCodeTypeId": 182,
                            "lkuCodeType": {
                                "codeType": "OBJECT_TYPE",
                                "description": "Object Type"
                            }
                        },
                        "objectTypeId": 889,
                        "fileSizeString": "194.3 KB"
                    }
                ],
                "id": 444,
                "title": "4319-1363176383640.jpg",
                "description": "Project Image   Design and Demonstration of a Constrained Control System for Maneuverable CubeSats",
                "libraryItemTypeId": 1095,
                "projectId": 4319,
                "primary": true,
                "publishedDateString": "",
                "contentType": {
                    "lkuCodeId": 1095,
                    "code": "IMAGE",
                    "description": "Image",
                    "lkuCodeTypeId": 341,
                    "lkuCodeType": {
                        "codeType": "LIBRARY_ITEM_TYPE",
                        "description": "Library Item Type"
                    }
                }
            }
        ],
        "transitions": [],
        "primaryImage": {
            "file": {
                "fileExtension": "jpg",
                "fileId": 1738,
                "fileSizeString": "0 Byte"
            },
            "id": 444,
            "description": "Project Image   Design and Demonstration of a Constrained Control System for Maneuverable CubeSats",
            "projectId": 4319,
            "publishedDateString": ""
        },
        "responsibleMd": {
            "acronym": "STMD",
            "canUserEdit": false,
            "city": "",
            "external": false,
            "linkCount": 0,
            "organizationId": 4875,
            "organizationName": "Space Technology Mission Directorate",
            "organizationType": "NASA_Mission_Directorate",
            "naorganization": false,
            "organizationTypePretty": "NASA Mission Directorate"
        },
        "program": {
            "acronym": "STRG",
            "active": true,
            "description": "<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ",
            "programId": 69,
            "responsibleMd": {
                "acronym": "STMD",
                "canUserEdit": false,
                "city": "",
                "external": false,
                "linkCount": 0,
                "organizationId": 4875,
                "organizationName": "Space Technology Mission Directorate",
                "organizationType": "NASA_Mission_Directorate",
                "naorganization": false,
                "organizationTypePretty": "NASA Mission Directorate"
            },
            "responsibleMdId": 4875,
            "stockImageFileId": 36658,
            "title": "Space Technology Research Grants"
        },
        "supportingOrganizations": [
            {
                "canUserEdit": false,
                "city": "Austin",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "external": true,
                "linkCount": 0,
                "organizationId": 3991,
                "organizationName": "The University of Texas at Austin",
                "organizationType": "Academia",
                "stateTerritory": {
                    "abbreviation": "TX",
                    "country": {
                        "abbreviation": "US",
                        "countryId": 236,
                        "name": "United States"
                    },
                    "countryId": 236,
                    "name": "Texas",
                    "stateTerritoryId": 29
                },
                "stateTerritoryId": 29,
                "msiData": {
                    "2021": [
                        "Asian American Native American Pacific Islander (AANAPISI)"
                    ],
                    "2022": [
                        "Asian American Native American Pacific Islander (AANAPISI)"
                    ]
                },
                "setAsideData": [],
                "murepUnitId": 228778,
                "naorganization": false,
                "organizationTypePretty": "Academia"
            }
        ],
        "statesWithWork": [
            {
                "abbreviation": "TX",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "name": "Texas",
                "stateTerritoryId": 29
            }
        ],
        "lastUpdated": "2018-10-10",
        "releaseStatusString": "Released",
        "endDateString": "Aug 2015",
        "startDateString": "Sep 2011"
    }
}