{
    "project": {
        "projectId": 4337,
        "title": "Modeling Propellant Tank Dynamics",
        "primaryTaxonomyNodes": [
            {
                "taxonomyNodeId": 10538,
                "taxonomyRootId": 8816,
                "parentNodeId": 10533,
                "level": 3,
                "code": "TX01.1.5",
                "title": "Hybrids",
                "definition": "Hybrid propulsion systems or subsystems operate with propellants that utilize a hybrid of solid fuel and liquid oxidizer.",
                "exampleTechnologies": "Acrylonitrile butadiene styrene thermoplastic, paraffin-based fuels",
                "hasChildren": false,
                "hasInteriorContent": true
            }
        ],
        "startTrl": 2,
        "currentTrl": 3,
        "endTrl": 3,
        "benefits": "Part of NASA's mission is to pioneer the future in space exploration. Hybrid rockets are a key component of that future because they will enable us to explore our solar system for a fraction of the cost of traditional rockets. This cost reduction is a result of both the inherent safety provided by a phase boundary between the solid fuel and liquid oxidizer, but also through the use of non-hazardous propellants like N2O. Nitrous oxide is an attractive oxidizer for hybrid rockets because it is self-pressurizing and therefore it can be pushed out of a propellant tank using only it's own high vapor pressure. This negates the need for turbopumps or inert gas pressurization systems, resulting in a more compact and lighter design. However, an accurate model for the tank's internal processes - and as a result the flowrate out of the tank - does not exist. Without such a model, development of hybrid rocket propulsion systems will be unnecessarily long and expensive because of the large amount of full-scale testing required to optimize the design.",
        "description": "The main objective of my work will be to develop accurate models of self-pressurizing propellant tanks for use in designing hybrid rockets. The first key goal is to develop an accurate and computationally attractive equation of state for nitrous oxide. N2O is a popular self-pressurizing oxidizer but standard operating temperatures are close to the critical point and therefore the oxidizer's thermodynamic properties are non-ideal and difficult to predict. The next goal is to develop a dynamic model for the numerous processes occurring in an emptying tank. This includes heat and mass transfer between phases, heat transfer to and from the walls of the tank, and fluid dynamics induced by convection and the propellant flowing out of the tank. Third, extensive experimentation must be done in order to benchmark the model and assess the presence and importance of certain processes such as nucleation, boiling, and vaporization. Finally, a design study must be done in order to determine how the finalized model can best be used to increase the performance of hybrid rockets.  Methods  Previous works in the chemical engineering industry have identified proper functional forms for equations of state of varying accuracy and computational cost. However, when fitted to data for N2O, the empirical data used for the most commonly used model was incomplete and hence errors were introduced. By modifying a standard form slightly and by re-fitting the proper constants using a larger dataset, I will create a much better model. A dynamic model will be generated by first searching the literature for accurate expressions for heat and mass transfer through unsteady nucleation, boiling, vaporization, and condensation. In contrast, the current state of the art for propellant tank modeling includes only simple expressions for convection from flat plates, and an assumption of uniform temperatures. Experiments will then be conducted by building a custom tank that contains numerous temperature sensors, in addition to pressure and optical sensors. By measuring the temperature field throughout the tank and using the pressure data, I will be able to obtain an accurate global picture of the thermodynamic state of the nitrous oxide, and assess its uniformity. Optics will also be necessary in order to determine the presence and strength of nucleation and boiling within the tank. Using advanced optimization methods, the designs of hybrid rocket propulsion systems for various applications such as launch vehicles, sounding rockets, and in-space propulsion will be optimized. In this way, the benefits of using an accurate propellant tank model in the design process can be demonstrated.  Significance  Part of NASA's mission is to pioneer the future in space exploration. Hybrid rockets are a key component of that future because they will enable us to explore our solar system for a fraction of the cost of traditional rockets. This cost reduction is a result of both the inherent safety provided by a phase boundary between the solid fuel and liquid oxidizer, but also through the use of non-hazardous propellants like N2O. Nitrous oxide is an attractive oxidizer for hybrid rockets because it is self-pressurizing and therefore it can be pushed out of a propellant tank using only it's own high vapor pressure. This negates the need for turbopumps or inert gas pressurization systems, resulting in a more compact and lighter design. However, an accurate model for the tank's internal processes - and as a result the flowrate out of the tank - does not exist. Without such a model, development of hybrid rocket propulsion systems will be unnecessarily long and expensive because of the large amount of full-scale testing required to optimize the design.",
        "startYear": 2011,
        "startMonth": 9,
        "endYear": 2015,
        "endMonth": 8,
        "statusDescription": "Completed",
        "principalInvestigators": [
            {
                "contactId": 51175,
                "firstName": "Brian",
                "lastName": "Cantwell",
                "fullName": "Brian Cantwell",
                "fullNameInverted": "Cantwell, Brian",
                "primaryEmail": "cantwell@stanford.edu",
                "publicEmail": false,
                "nacontact": false
            }
        ],
        "programDirectors": [
            {
                "contactId": 84634,
                "firstName": "Claudia",
                "lastName": "Meyer",
                "fullName": "Claudia M Meyer",
                "fullNameInverted": "Meyer, Claudia M",
                "middleInitial": "M",
                "primaryEmail": "claudia.m.meyer@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programExecutives": [
            {
                "contactId": 84634,
                "firstName": "Claudia",
                "lastName": "Meyer",
                "fullName": "Claudia M Meyer",
                "fullNameInverted": "Meyer, Claudia M",
                "middleInitial": "M",
                "primaryEmail": "claudia.m.meyer@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programManagers": [
            {
                "contactId": 183514,
                "firstName": "Hung",
                "lastName": "Nguyen",
                "fullName": "Hung D Nguyen",
                "fullNameInverted": "Nguyen, Hung D",
                "middleInitial": "D",
                "primaryEmail": "hung.d.nguyen@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "coInvestigators": [
            {
                "contactId": 238085,
                "firstName": "Jonah",
                "lastName": "Zimmerman",
                "fullName": "Jonah E Zimmerman",
                "fullNameInverted": "Zimmerman, Jonah E",
                "middleInitial": "E",
                "primaryEmail": "jonah.e.zimmerman@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "website": "https://www.nasa.gov/directorates/spacetech/home/index.html",
        "libraryItems": [
            {
                "caption": "Project Image   Modeling Propellant Tank Dynamics",
                "file": {
                    "fileExtension": "jpg",
                    "fileId": 1798,
                    "fileName": "4337-1363193066794",
                    "fileSize": 194342,
                    "objectId": 1044,
                    "objectType": {
                        "lkuCodeId": 889,
                        "code": "LIBRARY_ITEMS",
                        "description": "Library Items",
                        "lkuCodeTypeId": 182,
                        "lkuCodeType": {
                            "codeType": "OBJECT_TYPE",
                            "description": "Object Type"
                        }
                    },
                    "objectTypeId": 889,
                    "fileSizeString": "194.3 KB"
                },
                "files": [
                    {
                        "fileExtension": "jpg",
                        "fileId": 1798,
                        "fileName": "4337-1363193066794",
                        "fileSize": 194342,
                        "objectId": 1044,
                        "objectType": {
                            "lkuCodeId": 889,
                            "code": "LIBRARY_ITEMS",
                            "description": "Library Items",
                            "lkuCodeTypeId": 182,
                            "lkuCodeType": {
                                "codeType": "OBJECT_TYPE",
                                "description": "Object Type"
                            }
                        },
                        "objectTypeId": 889,
                        "fileSizeString": "194.3 KB"
                    }
                ],
                "id": 1044,
                "title": "4337-1363193066794.jpg",
                "description": "Project Image   Modeling Propellant Tank Dynamics",
                "libraryItemTypeId": 1095,
                "projectId": 4337,
                "primary": true,
                "publishedDateString": "",
                "contentType": {
                    "lkuCodeId": 1095,
                    "code": "IMAGE",
                    "description": "Image",
                    "lkuCodeTypeId": 341,
                    "lkuCodeType": {
                        "codeType": "LIBRARY_ITEM_TYPE",
                        "description": "Library Item Type"
                    }
                }
            }
        ],
        "transitions": [],
        "primaryImage": {
            "file": {
                "fileExtension": "jpg",
                "fileId": 1798,
                "fileSizeString": "0 Byte"
            },
            "id": 1044,
            "description": "Project Image   Modeling Propellant Tank Dynamics",
            "projectId": 4337,
            "publishedDateString": ""
        },
        "responsibleMd": {
            "acronym": "STMD",
            "canUserEdit": false,
            "city": "",
            "external": false,
            "linkCount": 0,
            "organizationId": 4875,
            "organizationName": "Space Technology Mission Directorate",
            "organizationType": "NASA_Mission_Directorate",
            "naorganization": false,
            "organizationTypePretty": "NASA Mission Directorate"
        },
        "program": {
            "acronym": "STRG",
            "active": true,
            "description": "<p> \tThe Space Technology Research Grants Program will accelerate the development of &quot;push&quot; technologies to support the future space science and exploration needs of NASA, other government agencies and the commercial space sector. Innovative efforts with high risk and high payoff will be encouraged. The program is composed of two competitively awarded components.</p> ",
            "programId": 69,
            "responsibleMd": {
                "acronym": "STMD",
                "canUserEdit": false,
                "city": "",
                "external": false,
                "linkCount": 0,
                "organizationId": 4875,
                "organizationName": "Space Technology Mission Directorate",
                "organizationType": "NASA_Mission_Directorate",
                "naorganization": false,
                "organizationTypePretty": "NASA Mission Directorate"
            },
            "responsibleMdId": 4875,
            "stockImageFileId": 36658,
            "title": "Space Technology Research Grants"
        },
        "statesWithWork": [
            {
                "abbreviation": "CA",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "name": "California",
                "stateTerritoryId": 59
            }
        ],
        "lastUpdated": "2018-10-10",
        "releaseStatusString": "Released",
        "endDateString": "Aug 2015",
        "startDateString": "Sep 2011"
    }
}