{
    "project": {
        "projectId": 4361,
        "title": "Low Power Microrobotics Utilizing Biologically Inspired Energy Generation",
        "primaryTaxonomyNodes": [
            {
                "taxonomyNodeId": 10810,
                "taxonomyRootId": 8816,
                "parentNodeId": 10808,
                "level": 3,
                "code": "TX11.1.2",
                "title": "Verification and Validation of Software systems",
                "definition": "The procedures and testing used to determine that a software system meets the requirements (verification) and fulfills its intended purpose (validation).",
                "exampleTechnologies": "Model-based testing, Payloads and Components Real-Time Automated Test System (PACRATS), Code coverage testing techniques, continuous automated software analysis and testing techniques, SysML Model Based Systems Engineering (MBSE)",
                "hasChildren": false,
                "hasInteriorContent": true
            }
        ],
        "startTrl": 1,
        "currentTrl": 2,
        "endTrl": 2,
        "benefits": "The Low Power Microrobotics (LPM) project is a NASA NIAC-funded multi-disciplinary research effort involving the research and advancement of low power electronics, low power mobility and their integration with state of the art microbial fuel cell for power generation. The goal of this project was to advance the capabilities of each of these systems with a 10-year future target of a near one kilogram space exploration vehicle that contains each of these systems.",
        "description": "In this Phase I study, the study team will investigate the usability of a microbial fuel cell to power a small microrover, design low-power electronics for effective power management of this system, and develop an efficient low-power non-traditional locomotion system to propel the lightweight vehicle forward. Description: building a small microrover that employs energy generated by a bacterial source Objective: investigate the usability of a microbial fuel cell to power a small microrover, design low-power electronics for effective power management, and develop an efficient low-power non-traditional locomotion system to propel the light-weight vehicle forward The Naval Research Lab is developing a 1 kilogram microrover that utilizes a novel power system concept – bacteria! Certain microbes can be harvested to effectively change chemical sugars into electricity through a fuel cell, which can provide a higher power density than a traditional lithium-ion battery. This process will be used to slowly build up a storage of electricity, which will provide a burst of energy to the vehicle's novel hopping or rolling mobility system. In this Phase I study, the study team will investigate the usability of a microbial fuel cell to power a small microrover, design low-power electronics for effective power management of this system, and develop an efficient low-power non-traditional locomotion system to propel the lightweight vehicle forward. Small microrovers with this power system could one day support long-duration research studies on planetary surfaces without the need for large solar panels or complex power systems. (This is a project within the NASA Innovative Advanced Concepts, NIAC, program.)",
        "destinations": [
            {
                "lkuCodeId": 1544,
                "code": "THE_MOON",
                "description": "The Moon",
                "lkuCodeTypeId": 526,
                "lkuCodeType": {
                    "codeType": "DESTINATION_TYPE",
                    "description": "Destination Type"
                }
            },
            {
                "lkuCodeId": 1518,
                "code": "MARS",
                "description": "Mars",
                "lkuCodeTypeId": 526,
                "lkuCodeType": {
                    "codeType": "DESTINATION_TYPE",
                    "description": "Destination Type"
                }
            },
            {
                "lkuCodeId": 1546,
                "code": "INSIDE_SOLAR_SYSTEM",
                "description": "Others Inside the Solar System",
                "lkuCodeTypeId": 526,
                "lkuCodeType": {
                    "codeType": "DESTINATION_TYPE",
                    "description": "Destination Type"
                }
            }
        ],
        "startYear": 2011,
        "startMonth": 9,
        "endYear": 2012,
        "endMonth": 9,
        "statusDescription": "Completed",
        "principalInvestigators": [
            {
                "contactId": 171736,
                "firstName": "Gregory",
                "lastName": "Scott",
                "fullName": "Gregory P Scott",
                "fullNameInverted": "Scott, Gregory P",
                "middleInitial": "P",
                "publicEmail": false,
                "nacontact": false
            }
        ],
        "programDirectors": [
            {
                "contactId": 205653,
                "firstName": "Jason",
                "lastName": "Derleth",
                "fullName": "Jason E Derleth",
                "fullNameInverted": "Derleth, Jason E",
                "middleInitial": "E",
                "primaryEmail": "jason.e.derleth@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programExecutives": [
            {
                "contactId": 205653,
                "firstName": "Jason",
                "lastName": "Derleth",
                "fullName": "Jason E Derleth",
                "fullNameInverted": "Derleth, Jason E",
                "middleInitial": "E",
                "primaryEmail": "jason.e.derleth@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "programManagers": [
            {
                "contactId": 142364,
                "firstName": "Eric",
                "lastName": "Eberly",
                "fullName": "Eric A Eberly",
                "fullNameInverted": "Eberly, Eric A",
                "middleInitial": "A",
                "primaryEmail": "eric.eberly@nasa.gov",
                "publicEmail": true,
                "nacontact": false
            }
        ],
        "libraryItems": [
            {
                "caption": "Project Image   Low Power Microrobotics Utilizing Biologically Inspired Energy Generation",
                "file": {
                    "fileExtension": "jpg",
                    "fileId": 102203,
                    "fileName": "15127",
                    "fileSize": 176083,
                    "objectId": 126731,
                    "objectType": {
                        "lkuCodeId": 889,
                        "code": "LIBRARY_ITEMS",
                        "description": "Library Items",
                        "lkuCodeTypeId": 182,
                        "lkuCodeType": {
                            "codeType": "OBJECT_TYPE",
                            "description": "Object Type"
                        }
                    },
                    "objectTypeId": 889,
                    "fileSizeString": "176.1 KB"
                },
                "files": [
                    {
                        "fileExtension": "jpg",
                        "fileId": 102203,
                        "fileName": "15127",
                        "fileSize": 176083,
                        "objectId": 126731,
                        "objectType": {
                            "lkuCodeId": 889,
                            "code": "LIBRARY_ITEMS",
                            "description": "Library Items",
                            "lkuCodeTypeId": 182,
                            "lkuCodeType": {
                                "codeType": "OBJECT_TYPE",
                                "description": "Object Type"
                            }
                        },
                        "objectTypeId": 889,
                        "fileSizeString": "176.1 KB"
                    }
                ],
                "id": 126731,
                "title": "15127.jpg",
                "description": "Project Image   Low Power Microrobotics Utilizing Biologically Inspired Energy Generation",
                "libraryItemTypeId": 1095,
                "projectId": 4361,
                "primary": true,
                "publishedDateString": "",
                "contentType": {
                    "lkuCodeId": 1095,
                    "code": "IMAGE",
                    "description": "Image",
                    "lkuCodeTypeId": 341,
                    "lkuCodeType": {
                        "codeType": "LIBRARY_ITEM_TYPE",
                        "description": "Library Item Type"
                    }
                }
            }
        ],
        "transitions": [
            {
                "transitionId": 7073,
                "projectId": 4361,
                "partner": "Other",
                "transitionDate": "2012-09-01",
                "infusion": "Other",
                "path": "Closed Out",
                "details": "Through the duration of this project, the research team had many achievements. The most significant of these achievements was proving that a microbial fuel cell could be used as a power generation subsystem to locomote a microrobotic system. This was shown not only in simulation, but proven through an end-to-end systems test at the Naval Research Laboratory. This was a considerable accomplishment under the NASA NIAC Phase I program. However, this technology is far from ready for daily use. Future research must be accomplished in order to strengthen this technology and improve the technology readiness level to eventual field use. Future directions for this work lie in each of the three primary research areas: microbial fuel cell energy generation, low power electronics, and low power actuation and locomotion. In the field of microbial fuel cells, research must be conducted reduce the system size while improving power output. Large pumps must be reduced or eliminated to make this technology appropriate for mobile systems. Efficiencies in membrane and electrode technology are already being investigated at the Naval Research Laboratory, but more attention will be needed in this area in the future. Investigations into eliminating the filters that process spent fuel and oxidant through the development of a complete ecosystem where these spent reactants are the primary inputs for another microbial reaction should also be performed. Additionally, as these systems progress to future uses in space, it is also essential to investigate microbes that could survive the radiation environment of space. In the field of low power electronics, research must be conducted to further improve the efficiency of the microelectronics used to harvest and distribute power within the system. An investigation into low power microprocessors or digital logic systems for onboard power management should be conducted to allow active charge and discharge scheduling processes. From a materials perspective, improvements in electro-chemical technologies to lower selfdischarge losses will increase the charge potential of these devices while reducing overall energy storage volume. In the field of low power locomotion, research must be conducted to more effectively channel electrical energy to activate an actuator. A more efficient approach to mechanical potential energy storage is also required to improve the overall efficiency of the locomotion system. This includes the use of more efficient electro-mechanical actuators, either linear or rotary motors. A more detailed analysis into a low gravity surface locomotion system is also necessary to ensure an optimal design for this environment. The future achievements of this technology could change the way researchers approach energy growth processes and drive science in a new direction. This can lead to the concept of a perpetual ecosystem which could be used in establishing regenerative power systems for human habited space stations or unmanned robotic systems on planetary bodies. More research is needed in each of these areas in order to bring about these advancements, but this NASA NIAC Phase I research has opened the door to developing novel low powered microrobotic systems fueled by microbial based energy generation. Educational outreach: Presented research at the From Science Fiction to Science Fact Seminar at the Chicago Museum of Science and Industry to ~500 students and their families. Supported several student projects at MSI. MSI talk inspired a student visit to NRL, and may lead to an internship at NRL in 2015.",
                "rationale": "Other",
                "infoText": "Closed out",
                "infoTextExtra": "",
                "dateText": "September 2012"
            }
        ],
        "primaryImage": {
            "file": {
                "fileExtension": "jpg",
                "fileId": 102203,
                "fileSizeString": "0 Byte"
            },
            "id": 126731,
            "description": "Project Image   Low Power Microrobotics Utilizing Biologically Inspired Energy Generation",
            "projectId": 4361,
            "publishedDateString": ""
        },
        "responsibleMd": {
            "acronym": "STMD",
            "canUserEdit": false,
            "city": "",
            "external": false,
            "linkCount": 0,
            "organizationId": 4875,
            "organizationName": "Space Technology Mission Directorate",
            "organizationType": "NASA_Mission_Directorate",
            "naorganization": false,
            "organizationTypePretty": "NASA Mission Directorate"
        },
        "program": {
            "acronym": "NIAC",
            "active": true,
            "description": "The NASA Innovative Advanced Concepts (NIAC) Program nurtures visionary ideas that could transform future NASA missions with the creation of breakthroughs - radically better or entirely new aerospace concepts - while engaging America's innovators and entrepreneurs as partners in the journey. NIAC projects study innovative, technically credible, advanced concepts that could one day \"Change the Possible\" in aerospace. The program is run from NASA Headquarters, Space Technology Mission Directorate.",
            "programId": 68,
            "responsibleMd": {
                "acronym": "STMD",
                "canUserEdit": false,
                "city": "",
                "external": false,
                "linkCount": 0,
                "organizationId": 4875,
                "organizationName": "Space Technology Mission Directorate",
                "organizationType": "NASA_Mission_Directorate",
                "naorganization": false,
                "organizationTypePretty": "NASA Mission Directorate"
            },
            "responsibleMdId": 4875,
            "stockImageFileId": 36657,
            "title": "NASA Innovative Advanced Concepts"
        },
        "leadOrganization": {
            "acronym": "NRL",
            "canUserEdit": false,
            "city": "Washington",
            "country": {
                "abbreviation": "US",
                "countryId": 236,
                "name": "United States"
            },
            "countryId": 236,
            "external": true,
            "linkCount": 0,
            "organizationId": 4855,
            "organizationName": "Naval Research Laboratory",
            "organizationType": "US_Government",
            "stateTerritory": {
                "abbreviation": "DC",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "name": "District of Columbia",
                "stateTerritoryId": 26
            },
            "stateTerritoryId": 26,
            "naorganization": false,
            "organizationTypePretty": "US Government"
        },
        "supportingOrganizations": [
            {
                "canUserEdit": false,
                "city": "Redmond",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "external": true,
                "linkCount": 0,
                "organizationId": 3764,
                "organizationName": "MSNW, LLC",
                "organizationType": "Industry",
                "stateTerritory": {
                    "abbreviation": "WA",
                    "country": {
                        "abbreviation": "US",
                        "countryId": 236,
                        "name": "United States"
                    },
                    "countryId": 236,
                    "name": "Washington",
                    "stateTerritoryId": 11
                },
                "stateTerritoryId": 11,
                "ein": "043570443 ",
                "dunsNumber": "044381445",
                "naorganization": false,
                "organizationTypePretty": "Industry"
            }
        ],
        "statesWithWork": [
            {
                "abbreviation": "DC",
                "country": {
                    "abbreviation": "US",
                    "countryId": 236,
                    "name": "United States"
                },
                "countryId": 236,
                "name": "District of Columbia",
                "stateTerritoryId": 26
            }
        ],
        "lastUpdated": "2022-8-22",
        "releaseStatusString": "Released",
        "endDateString": "Sep 2012",
        "startDateString": "Sep 2011"
    }
}